/// Вариант 3.
/// Вывести значение i-го бита числа x (0<x<10^9).


#include <iostream>                 // input output stream

int main() {                        // int значит, что в конце она вернёт целое число
    int x, i;                       // объявляем две переменные целого типа (int): x это само число, i это номер бита
    std::cin >> x >> i;             // standard console input, «консольный ввод»; >> «положи в»; читаем с клавиатуры два числа: первое в x, второе в i

    std::cout << ((x >> i) & 1);    // console output; << «выведи на экран»

                                    // x >> i: >> сдвиг вправо (shift right). Двоичная запись числа сдвигается на i позиций вправо,
                                    // лишние цифры справа пропадают; то же самое, что x // 2**i в Python, нужный бит оказывается в самом конце
                                    //& 1: & это побитовое AND; oставляет только последнюю цифру, остальные превращает в нули; то же самое, что % 2

    return 0;                       // возвращаем 0, что значит «программа завершилась без ошибок»
}


// для примера возьмём x = 13, это 1101, биты нумеруются справа налево, с нуля:

//цифры:   1  1  0  1
//номера:  3  2  1  0

// если i = 2, то ответ будет 1